Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/european_government/eu_institutions/european_council.html.txt.tmx
Source language: en
Languages: ga

source: The European Council defines the EU's overall political direction and priorities
ga: Déanann an Chomhairle Eorpach treo agus tosaíochtaí foriomlána polaitiúla an AE a shainiú

source: It is not one of the EU's legislating institutions, so it does not negotiate or adopt EU laws
ga: Níl an Chomhairle i measc institiúidí reachtaithe an AE, mar sin, ní dhéanann siad dlíthe an AE a idirbheartú nó glacadh leo

source: The European Council is also responsible for defining strategic guidelines for the area of freedom, security and justice
ga: Tá an Chomhairle Eorpach freagrach, chomh maith, as sainmhíniú a thabhairt ar threoirlínte straitéiseacha do limistéar na saoirse, na slándála agus an cheartais

source: The members of the European Council are the heads of state or government of the EU member states, the European Council President and the President of the European Commission
ga: Cinn stáit nó rialtais bhallstáit an AE, Uachtarán na Comhairle Eorpaí agus Uachtarán an Choimisiúin Eorpaigh atá i gcomhaltaí na Comhairle Eorpaí

source: The EU’s High Representative for Foreign Affairs and Security Policy also takes part when foreign affairs are discussed
ga: Anuas air sin, glacann Ardionadaí an AE don Chomhbheartas Eachtrach agus Slándála páirt, chomh maith, nuair a dhéantar plé ar ghnóthaí eachtracha

source: European Council meetings are essentially summits where EU leaders meet to decide on broad political priorities and major initiatives
ga: Cruinnithe mullaigh atá i gcruinnithe na Comhairle Eorpaí, go bunúsach, áit a gcasann ceannasaithe an AE ar a chéile chun cinneadh a dhéanamh ar thosaíochtaí fairsinge polaitiúla agus ar thionscnaimh mhóra

source: The Council meets at least twice every 6 months in Brussels
ga: Casann an Chomhairle ar a chéile ar a laghad dhá uair gach 6 mhí sa Bhruiséil

source: Meetings are chaired by the European Council President
ga: Bíonn Uachtarán na Comhairle Eorpaí ina chathaoirleach ar na cruinnithe

source: The President of the European Parliament attends the start of each meeting, to outline the European Parliament's views
ga: Freastalaíonn Uachtarán Pharlaimint na hEorpa ar thús gach cruinnithe, chun cuntas a thabhairt ar thuairimí Pharlaimint na hEorpa

source: Other people, such as the President of the European Central Bank, may be invited to attend meetings, depending on the issues being discussed
ga: Féadtar cuireadh a thabhairt do dhaoine eile, ar nós Uachtarán an Bhainc Cheannais Eorpaigh, chun freastal ar chruinnithe, ag brath ar na saincheisteanna atá á bplé

source: The European Council mostly takes its decisions by consensus
ga: Déanann an Chomhairle Eorpach a gcuid cinntí, den chuid is mó, trí chinntí comhthola

source: However, in certain specific cases outlined in the EU treaties, it decides by unanimity or by qualified majority
ga: Ar a shon sin, i gcásanna ar leith áirithe a dtugtar cuntas orthu i gconarthaí an AE, déanann siad cinneadh trí aontoilíocht nó trí thromlach cáilithe

source: If a vote is taken, neither the European Council President nor the Commission President takes part
ga: Má chaitear vóta, ní ghlacann Uachtarán na Comhairle Eorpaí ná Uachtarán an Choimisiúin Eorpaigh páirt

source: The European Council has a formal role to play in the EU's annual European semester process
ga: Tá ról foirmiúil le comhlíonadh ag an gComhairle Eorpach i bpróiseas sheimeastar bliantúil Eorpach an AE

source: This is the EU's yearly cycle of economic and fiscal policy coordination
ga: Timthriall bliantúil an AE de bheartais gheilleagracha agus fhioscacha a chomhordú is ea seo

source: At its annual March meeting, the European Council assesses both the economic situation in the EU and progress towards the Europe 2020 targets
ga: Ag a gcruinniú bliantúil i Márta, déanann an Chomhairle Eorpach measúnú ar an gcás geilleagrach san AE agus ar dhul chun cinn i dtreo spriocanna an Eoraip 2020

source: It then gives policy orientations on fiscal, economic and structural reforms
ga: Cuireann siad seisiúin tionscnaimh bheartais ar bun, ina dhiaidh sin, ar athchóirithe fioscacha, geilleagracha agus struchtúracha

source: At its June meeting, the European Council endorses the final country-specific recommendations, which set out priorities for each member state for the next 12-18 months
ga: Ag a gcruinniú i mí an Mheithimh, formhuiníonn an Chomhairle Eorpach na moltaí deiridh a bhaineann go sonrach le tíortha, ina leagtar amach tosaíochtaí do gach ballstát do na chéad 12-18 mí amach rompu

source: Further information on the European Council is available on the europa.eu website
ga: Tá fáil ar thuilleadh faisnéise ar an gComhairle Eorpach ar láithreán gréasáin europa.eu
